Repository: daaihang/sprout
Catalog: mory/mory/Localizable.xcstrings
Source language: en
Languages: zh_hans

# debug.captureCardLab.edge.manualMusic.detail
source: A manually searched song should not look like automatic context.
zh_hans: 手动搜索的歌曲不应该看起来像自动上下文。

# debug.captureCardLab.edge.manualMusic.title
source: Searched song
zh_hans: 搜索歌曲

# debug.captureCardLab.edge.noImage.detail
source: Photo has no generated thumbnail yet.
zh_hans: 照片尚未生成缩略图。

# debug.captureCardLab.edgeCases.subtitle
source: Long text, missing media, manual music, and context weather.
zh_hans: 长文本、缺失媒体、手动音乐和上下文天气。

# debug.captureCardLab.edgeCases.title
source: Edge Cases
zh_hans: 边界场景

# debug.captureCardLab.fixture.audio.detail
source: I should remember the way this idea clicked after lunch.
zh_hans: 我要记住午饭后这个想法突然串起来的感觉。

# debug.captureCardLab.fixture.audio.metadata
source: Transcript ready
zh_hans: 转写已完成

# debug.captureCardLab.fixture.audio.title
source: Voice note
zh_hans: 语音记录

# debug.captureCardLab.fixture.photo.detail
source: Three photos from the kitchen table.
zh_hans: 餐桌旁拍下的三张照片。

# debug.captureCardLab.fixture.photo.title
source: Weekend light
zh_hans: 周末的光

# debug.captureCardLab.fixture.place.detail
source: Shanghai, near the corner cafe.
zh_hans: 上海，街角咖啡店附近。

# debug.captureCardLab.fixture.place.title
source: Anfu Road
zh_hans: 安福路

# debug.captureCardLab.fixture.todo.detail
source: Send the draft invitation before Friday.
zh_hans: 周五前发送邀请草稿。

# debug.captureCardLab.fixture.todo.title
source: Follow up
zh_hans: 跟进

# debug.captureCardLab.fixture.weather.metadata
source: Captured nearby
zh_hans: 附近采集

# debug.captureCardLab.intensity.balanced
source: Balanced
zh_hans: 均衡

# debug.captureCardLab.intensity.calm
source: Calm
zh_hans: 克制

# debug.captureCardLab.intensity.vivid
source: Vivid
zh_hans: 鲜明

# debug.captureCardLab.music.chooseResult
source: Choose a result to preview a Manual music card.
zh_hans: 选择一个结果以预览手动音乐卡。

# debug.captureCardLab.music.loadedNowPlaying
source: Loaded current playing song as a Context preview.
zh_hans: 已将当前播放歌曲加载为上下文预览。

# debug.captureCardLab.music.loadingNowPlaying
source: Loading now playing
zh_hans: 正在加载当前播放

# debug.captureCardLab.music.loadNowPlaying
source: Load current playing song
zh_hans: 加载当前播放歌曲

# debug.captureCardLab.music.noCardGenerated
source: No card generated
zh_hans: 未生成卡片

# debug.captureCardLab.music.noContentCard
source: No music content card was generated.
zh_hans: 没有生成音乐内容卡。

# debug.captureCardLab.music.noCurrentSong.detail
source: No playing song is available, or Music authorization is unavailable.
zh_hans: 没有正在播放的歌曲，或音乐授权不可用。

# debug.captureCardLab.music.noCurrentSong.title
source: No current song
zh_hans: 没有当前歌曲

# debug.captureCardLab.music.noSongsOrAuthorization
source: No songs found or Music authorization unavailable.
zh_hans: 没有找到歌曲，或音乐授权不可用。

# debug.captureCardLab.music.paused.detail
source: A context candidate should calm down when playback pauses.
zh_hans: 播放暂停时，上下文候选也应该降低动态感。

# debug.captureCardLab.music.paused.title
source: Paused song
zh_hans: 已暂停歌曲

# debug.captureCardLab.music.searching
source: Searching music
zh_hans: 正在搜索音乐

# debug.captureCardLab.music.searchPreview
source: Search music preview
zh_hans: 搜索音乐预览

# debug.captureCardLab.music.stopped.detail
source: Playback is stopped, so no context card should be generated.
zh_hans: 播放已停止，因此不应生成上下文卡。

# debug.captureCardLab.music.unavailable.detail
source: Music permission or queue data is unavailable.
zh_hans: 音乐权限或播放队列数据不可用。

# debug.captureCardLab.origins.detail
source: One place card rendered with the selected source display mode.
zh_hans: 同一地点卡按选中的来源显示模式渲染。

# debug.captureCardLab.origins.title
source: Same place
zh_hans: 同一地点

# debug.captureCardLab.palette.default.detail
source: Fallback type color palette.
zh_hans: 类型色的兜底调色板。

# debug.captureCardLab.palette.default.title
source: Default
zh_hans: 默认

# debug.captureCardLab.palette.music.detail
source: Album-derived palette
zh_hans: 从专辑提取的调色板

# debug.captureCardLab.palette.music.title
source: Artwork color
zh_hans: 封面颜色

# debug.captureCardLab.palette.photo.detail
source: Thumbnail-derived accent.
zh_hans: 从缩略图提取强调色。

# debug.captureCardLab.palette.photo.title
source: Sampled photo
zh_hans: 采样照片

# debug.captureCardLab.palette.subtitle
source: Default, weather, map, sampled photo, and music artwork palettes driving borders, text, and content surfaces.
zh_hans: 默认、天气、地图、照片采样和音乐封面调色板会驱动边框、文字和内容表面。

# debug.captureCardLab.palette.title
source: Palette Preview
zh_hans: 调色板预览

# debug.captureCardLab.palette.weather.detail
source: 18°C · rain palette
zh_hans: 18°C · 雨天调色板

# debug.captureCardLab.photo.carousel.detail
source: Subtle movement for a larger image group.
zh_hans: 为更大的图片组提供轻微动态。

# debug.captureCardLab.photo.carousel.title
source: Carousel set
zh_hans: 轮播组

# debug.captureCardLab.photo.mosaic.detail
source: A compact preview for several photos.
zh_hans: 多张照片的紧凑预览。

# debug.captureCardLab.photo.mosaic.title
source: Mosaic set
zh_hans: 拼贴组

# debug.captureCardLab.photo.single.detail
source: Full-bleed image card
zh_hans: 全幅图片卡

# debug.captureCardLab.photo.single.title
source: Single photo
zh_hans: 单张照片

# debug.captureCardLab.photo.stack.detail
source: Multiple images as a small pile.
zh_hans: 多张图片以小堆叠呈现。

# debug.captureCardLab.photo.stack.title
source: Stacked set
zh_hans: 堆叠组

# debug.captureCardLab.photoGroups.subtitle
source: Single images render full-bleed; multi-photo fixtures compare mosaic, stack, and gentle carousel treatments without changing photo artifacts.
zh_hans: 单张图全幅显示；多图样例对比拼贴、堆叠和轻轮播处理，不改变照片 artifact。

# debug.captureCardLab.photoGroups.title
source: Photo Groups
zh_hans: 照片组

# debug.captureCardLab.place.current.detail
source: Shanghai · near the corner cafe
zh_hans: 上海 · 街角咖啡店附近

# debug.captureCardLab.place.current.label
source: Current context
zh_hans: 当前上下文

# debug.captureCardLab.place.generateSnapshot
source: Generate map snapshot
zh_hans: 生成地图快照

# debug.captureCardLab.place.generatingMap
source: Generating map
zh_hans: 正在生成地图

# debug.captureCardLab.place.manual.detail
source: A hand-picked point on the map.
zh_hans: 在地图上手动选择的点。

# debug.captureCardLab.place.manual.label
source: Manual map pin
zh_hans: 手动地图点

# debug.captureCardLab.place.manual.title
source: Selected point
zh_hans: 已选点

# debug.captureCardLab.place.nearDifferentName.detail
source: Coordinates are close, but the resolved name changed.
zh_hans: 坐标很近，但解析出的名称不同。

# debug.captureCardLab.place.nearDifferentName.label
source: Near different name
zh_hans: 近距离异名

# debug.captureCardLab.place.nearDifferentName.metadata
source: Nearby
zh_hans: 附近

# debug.captureCardLab.place.nearDifferentName.title
source: Different reverse geocode
zh_hans: 不同反向地理编码

# debug.captureCardLab.place.noCoordinate.detail
source: No coordinates available yet.
zh_hans: 暂无可用坐标。

# debug.captureCardLab.place.noCoordinate.label
source: No coordinate
zh_hans: 无坐标

# debug.captureCardLab.place.noCoordinate.metadata
source: No map
zh_hans: 无地图

# debug.captureCardLab.place.noCoordinate.title
source: Imported place name
zh_hans: 导入地点名称

# debug.captureCardLab.place.privacy
source: Privacy
zh_hans: 隐私

# debug.captureCardLab.place.sameNameFar.detail
source: Name match but coordinates should keep it separate.
zh_hans: 名称匹配，但坐标应保持分开。

# debug.captureCardLab.place.sameNameFar.label
source: Same name far away
zh_hans: 同名远距离

# debug.captureCardLab.place.sameNameFar.metadata
source: Far coordinate
zh_hans: 远距离坐标

# debug.captureCardLab.place.snapshotFailed
source: No snapshot generated. Fallback map texture is still displayed.
zh_hans: 未生成快照，仍显示兜底地图纹理。

# debug.captureCardLab.place.snapshotGenerated
source: Generated static MapKit snapshot.
zh_hans: 已生成静态 MapKit 快照。

# debug.captureCardLab.state.disabled.detail
source: This card is visible but not currently interactive.
zh_hans: 此卡片可见，但当前不可交互。

# debug.captureCardLab.state.disabled.title
source: Disabled
zh_hans: 已禁用

# debug.captureCardLab.state.error.detail
source: Location permission is unavailable.
zh_hans: 位置权限不可用。

# debug.captureCardLab.state.error.metadata
source: Retry available
zh_hans: 可重试

# debug.captureCardLab.state.error.title
source: Context failed
zh_hans: 上下文失败

# debug.captureCardLab.state.loading.detail
source: Looking for nearby place, weather, and music.
zh_hans: 正在查找附近地点、天气和音乐。

# debug.captureCardLab.state.loading.title
source: Collecting context
zh_hans: 正在采集上下文

# debug.captureCardLab.state.normal.detail
source: A regular card with no transient state.
zh_hans: 没有临时状态的普通卡片。

# debug.captureCardLab.state.normal.metadata
source: Ready
zh_hans: 就绪

# debug.captureCardLab.state.normal.title
source: Normal
zh_hans: 正常

# debug.captureCardLab.state.removable.detail
source: Manual attachments can expose a remove affordance.
zh_hans: 手动附件可以显示移除入口。

# debug.captureCardLab.state.removable.metadata
source: Removable
zh_hans: 可移除

# debug.captureCardLab.state.removable.title
source: Removable
zh_hans: 可移除

# debug.captureCardLab.state.selected.detail
source: A selected card uses a content-colored stroke without changing its content type.
zh_hans: 选中卡片使用内容色描边，但不改变内容类型。

# debug.captureCardLab.state.selected.title
source: Selected
zh_hans: 已选中

# debug.captureCardLab.states.subtitle
source: Selection, loading, error, disabled, and removable affordances.
zh_hans: 选中、加载、错误、禁用和可移除状态。

# debug.captureCardLab.states.title
source: States
zh_hans: 状态

# debug.captureCardLab.status.context.detail
source: Checking place, weather, and currently playing music.
zh_hans: 正在检查地点、天气和当前播放音乐。

# debug.captureCardLab.status.context.title
source: Collecting context
zh_hans: 正在采集上下文

# debug.captureCardLab.status.emptyContext.detail
source: Nothing automatic will be added unless the user chooses it.
zh_hans: 除非用户主动选择，否则不会自动添加任何内容。

# debug.captureCardLab.status.emptyContext.title
source: No context found
zh_hans: 未找到上下文

# debug.captureCardLab.status.photoProcessing.detail
source: Preparing the image attachment.
zh_hans: 正在准备图片附件。

# debug.captureCardLab.status.photoProcessing.title
source: Processing photo
zh_hans: 正在处理照片

# debug.captureCardLab.status.processing
source: Processing
zh_hans: 处理中

# debug.captureCardLab.status.subtitle
source: Temporary cards for context collection, photo processing, transcript refinement, and empty states.
zh_hans: 用于上下文采集、照片处理、转写润色和空状态的临时卡片。

# debug.captureCardLab.status.title
source: Status
zh_hans: 状态

# debug.captureCardLab.status.voiceRefining.detail
source: Cleaning repeated words and generating a concise internal title.
zh_hans: 清理重复口癖，并生成简洁的内部标题。

# debug.captureCardLab.status.voiceRefining.title
source: Refining transcript
zh_hans: 正在润色转写

# debug.captureCardLab.type.subtitle
source: Production and debug variants for this content kind.
zh_hans: 该内容类型的生产态和调试态变体。

# debug.captureCardLab.weather.temperature.format
source: Temperature %lld°C
zh_hans: 温度 %lld°C

# debug.chain.analysis
source: Analysis
zh_hans: 解析

# debug.chain.arc
source: Arc
zh_hans: 故事线

# debug.chain.artifacts
source: Artifacts
zh_hans: 附件

# debug.chain.graph
source: Graph
zh_hans: 关系图

# debug.chain.missing
source: Missing
zh_hans: 缺失

# debug.chain.noAnalysis
source: No analysis
zh_hans: 无解析

# debug.chain.noFixture
source: No fixture chain for the selected target.
zh_hans: 所选目标没有数据链路。

# debug.chain.record
source: Record
zh_hans: 记录

# debug.chain.reflection
source: Reflection
zh_hans: 感悟

# debug.context.collect
source: Collect Context
zh_hans: 采集上下文

# debug.context.collecting
source: Collecting Context...
zh_hans: 正在采集上下文...

# debug.context.count
source: %lld context drafts collected.
zh_hans: 已采集 %lld 个上下文草稿。

# debug.context.empty
source: No location, weather, or music artifacts are linked to this memory.
zh_hans: 这条记忆没有关联地点、天气或音乐 Artifact。

# debug.context.footer
source: Collection uses the same 3-second timeout path as capture save.
zh_hans: 采集使用与保存记忆相同的 3 秒超时路径。

# debug.context.location
source: Location
zh_hans: 定位

# debug.context.music
source: Music
zh_hans: 音乐

# debug.context.permissions
source: Permissions
zh_hans: 权限

# debug.context.requestLocation
source: Request Location Permission
zh_hans: 请求定位权限

# debug.context.requestMusic
source: Request Music Permission
zh_hans: 请求音乐权限

# debug.context.results
source: Collected Drafts
zh_hans: 已采集草稿

# debug.custom.body
source: Memory content
zh_hans: 记忆内容

# debug.custom.context
source: Input context
zh_hans: 输入上下文

# debug.custom.contextAdded
source: Context added to this diagnostic memory
zh_hans: 已添加到这条诊断记忆的上下文

# debug.custom.create
source: Create and run pipeline
zh_hans: 创建并运行管线

# debug.custom.creating
source: Creating...
zh_hans: 正在创建...

# debug.custom.footer
source: Create a real debug memory from custom content, optionally attach automatic context, then inspect the exact pipeline payload and trace.
zh_hans: 用自定义内容创建真实调试记忆，可选择附加自动上下文，然后检查实际管线 payload 和 trace。

# debug.custom.includeContext
source: Collect location, weather, and music now
zh_hans: 立即采集地点、天气和音乐

# debug.custom.mood
source: Mood
zh_hans: 心情

# debug.custom.title
source: Title
zh_hans: 标题

# debug.detail.copy
source: Copy
zh_hans: 复制

# debug.detail.pretty
source: Pretty
zh_hans: 格式化

# debug.detail.share
source: Share
zh_hans: 分享

# debug.environment.build
source: Build
zh_hans: 构建号

# debug.environment.buildChannel
source: Build Channel
zh_hans: 构建渠道

# debug.environment.debugTools
source: Debug Tools
zh_hans: 调试工具

# debug.environment.distribution
source: Distribution
zh_hans: 分发方式

# debug.environment.footer
source: iOS can reliably distinguish Debug, development install, TestFlight receipt, and App Store receipt. Internal vs public beta requires the MORY_BUILD_CHANNEL build setting.
zh_hans: iOS 可以可靠区分 Debug、开发安装、TestFlight 收据和 App Store 收据。内测与公测需要通过 MORY_BUILD_CHANNEL 构建设置区分。

# debug.environment.version
source: Version
zh_hans: 版本

# debug.export.copyReport
source: Copy Full Debug Report
zh_hans: 复制完整调试报告

# debug.export.footer
source: Copies target info, chain status, request/response payloads, pipeline trace, errors, and provenance as a single text block for debugging.
zh_hans: 将目标信息、链路状态、请求/响应数据、处理跟踪、错误和来源复制为一段调试文本。

# debug.link.autoDetect
source: Body URL Auto-detect
zh_hans: 正文链接自动识别

# debug.link.autoDetectFooter
source: Matches the Composer behavior: only the first URL in the text is extracted.
zh_hans: 与新建记忆行为一致：只提取正文中的第一个 URL。

# debug.link.autoDetectResult
source: Detected Link Metadata
zh_hans: 识别出的链接元数据

# debug.link.bodyInput
source: Text containing a URL
zh_hans: 包含 URL 的正文

# debug.link.cloudResult
source: Cloud Result
zh_hans: 云端结果

# debug.link.detectBody
source: Detect Body URL
zh_hans: 识别正文 URL

# debug.link.detectedURL
source: Detected URL
zh_hans: 识别出的 URL

# debug.link.detecting
source: Detecting URL...
zh_hans: 正在识别 URL...

# debug.link.fetch
source: Fetch Metadata
zh_hans: 获取元数据

# debug.link.fetching
source: Fetching metadata...
zh_hans: 正在获取元数据...

# debug.link.footer
source: Use this to test normal URLs, short links, and social post redirects. Local metadata uses the same extractor as Capture.
zh_hans: 用于测试普通链接、短链接和社交帖子跳转。本地元数据与新建记忆使用同一套解析器。

# debug.link.imageBytes
source: Image Bytes
zh_hans: 图片字节数

# debug.link.inputURL
source: Input URL
zh_hans: 输入 URL

# debug.link.noDetectedURL
source: No URL was detected in the text.
zh_hans: 正文中没有识别到 URL。

# debug.link.noResult
source: Link metadata returned no result. Check URL and network access.
zh_hans: 链接元数据没有返回结果。请检查 URL 和网络访问。

# debug.link.normalizedURL
source: Normalized URL
zh_hans: 规范化 URL

# debug.link.result
source: Link Metadata
zh_hans: 链接元数据

# debug.link.runCloud
source: Run Cloud Analysis
zh_hans: 运行云端分析

# debug.link.runningCloud
source: Running Cloud Analysis...
zh_hans: 正在运行云端分析...

# debug.link.site
source: Site
zh_hans: 站点

# debug.menu.auth
source: Auth Session
zh_hans: 认证会话

# debug.menu.auth.subtitle
source: Sign-in state, Keychain credential, and server auth errors
zh_hans: 登录状态、Keychain 凭据和服务端认证错误

# debug.menu.capabilities
source: Capability Tests
zh_hans: 能力测试

# debug.menu.capabilities.subtitle
source: Photo, context, speech, link, and cloud pipeline probes
zh_hans: 图片、上下文、语音、链接和云端链路探针

# debug.menu.environment
source: Build Environment
zh_hans: 构建环境

# debug.menu.footer
source: Internal diagnostics are enabled for Debug, development installs, and InternalBeta TestFlight builds only.
zh_hans: 内部诊断仅在 Debug、开发安装和 InternalBeta TestFlight 构建中启用。

# debug.menu.pipeline
source: Pipeline Diagnostics
zh_hans: 管线诊断

# debug.menu.pipeline.subtitle
source: Target picker, rebuild actions, payloads, provenance, and traces
zh_hans: 目标选择、重建操作、载荷、溯源和 trace

# debug.notification.checkSession
source: Run Session Restore Check
zh_hans: 运行会话恢复检查

# debug.notification.checkSession.done
source: Session restore check completed.
zh_hans: 会话恢复检查已完成。

# debug.notification.coldStart
source: Cold-Start Restore
zh_hans: 冷启动恢复

# debug.notification.coldStart.footer
source: This calls the same checkSession path used at app launch and refreshes auth diagnostics.
zh_hans: 这里调用启动时使用的同一条 checkSession 路径，并刷新登录诊断。

# debug.notification.debugTools
source: Debug Tools
zh_hans: 调试工具

# debug.notification.footer
source: This listens for the same pipelineDidComplete notification used by detail refresh. The test button posts a local notification only.
zh_hans: 这里监听详情刷新使用的同一个 pipelineDidComplete 通知。测试按钮只发送本地通知。

# debug.notification.lastPipeline
source: Last Pipeline Notification
zh_hans: 最近管线通知

# debug.notification.none
source: No pipeline notification observed yet.
zh_hans: 尚未观察到管线通知。

# debug.notification.pipeline
source: Pipeline Notification
zh_hans: 管线通知

# debug.notification.postTest
source: Post Test Notification
zh_hans: 发送测试通知

# debug.notification.receipt
source: Receipt
zh_hans: 收据

# debug.notification.receipt.detected
source: Detected distribution: %@
zh_hans: 检测到的分发状态：%@

# debug.notification.receipt.none
source: No receipt URL
zh_hans: 无收据 URL

# debug.notification.runtime
source: Runtime
zh_hans: 运行时

# debug.notification.scene.active
source: Active
zh_hans: 活跃

# debug.notification.scene.background
source: Background
zh_hans: 后台

# debug.notification.scene.inactive
source: Inactive
zh_hans: 非活跃

# debug.notification.scenePhase
source: Scene Phase
zh_hans: 场景状态

# debug.payload.copyAll
source: Copy All %@ Payloads
zh_hans: 复制全部 %@ 载荷

# debug.payload.empty
source: (empty)
zh_hans: （空）

# debug.payload.error
source: Error
zh_hans: 错误

# debug.payload.noAnalysis
source: No analysis payload for this target.
zh_hans: 此目标没有解析数据。

# debug.payload.noReflection
source: No reflection payload for this target.
zh_hans: 此目标没有感悟数据。

# debug.payload.rawErrorBody
source: Raw Error Body
zh_hans: 原始错误内容

# debug.payload.request
source: Request
zh_hans: 请求

# debug.payload.response
source: Response
zh_hans: 响应

# debug.permission.footer
source: Use this page on a real device and TestFlight builds to verify permission state and capability wiring.
zh_hans: 请在真机和 TestFlight 构建上使用本页验证权限状态和 capability 接线。

# debug.permission.location
source: Location
zh_hans: 定位

# debug.permission.matrix
source: Matrix
zh_hans: 矩阵

# debug.permission.microphone
source: Microphone
zh_hans: 麦克风

# debug.permission.photos
source: Photos
zh_hans: 照片

# debug.permission.refresh
source: Refresh Matrix
zh_hans: 刷新矩阵

# debug.permission.request.location
source: Request Location Permission
zh_hans: 请求定位权限

# debug.permission.request.microphone
source: Request Microphone Permission
zh_hans: 请求麦克风权限

# debug.permission.request.music
source: Request Music Permission
zh_hans: 请求音乐权限

# debug.permission.request.photos
source: Request Photos Permission
zh_hans: 请求照片权限

# debug.permission.request.speech
source: Request Speech Permission
zh_hans: 请求语音识别权限

# debug.permission.speech
source: Speech Recognition
zh_hans: 语音识别

# debug.permission.weather.failed
source: WeatherKit returned no weather. Check capability, entitlement, and network.
zh_hans: WeatherKit 没有返回天气。请检查 capability、entitlement 和网络。

# debug.permission.weather.locationRequired
source: Location authorization is required before testing WeatherKit.
zh_hans: 测试 WeatherKit 前需要定位授权。

# debug.permission.weather.noLocation
source: No current location was available.
zh_hans: 当前没有可用定位。

# debug.permission.weather.notTested
source: Not tested yet
zh_hans: 尚未测试

# debug.permission.weather.test
source: Test WeatherKit
zh_hans: 测试 WeatherKit

# debug.permission.weather.testing
source: Testing WeatherKit...
zh_hans: 正在测试 WeatherKit...

# debug.photo.cloudResult
source: Cloud Result
zh_hans: 云端结果

# debug.photo.footer
source: Local parsing runs Vision classification, OCR, EXIF extraction, and thumbnail generation. Cloud analysis persists a debug memory.
zh_hans: 本地解析会运行 Vision 分类、OCR、EXIF 提取和缩略图生成。云端分析会保存一条调试记忆。

# debug.photo.localResult
source: Local Result
zh_hans: 本地结果

# debug.photo.metadata
source: Metadata
zh_hans: 元数据

# debug.photo.ocr
source: OCR Text
zh_hans: OCR 文本

# debug.photo.processingLocal
source: Parsing photo locally...
zh_hans: 正在本地解析图片...

# debug.photo.runCloud
source: Run Cloud Analysis
zh_hans: 运行云端分析

# debug.photo.runningCloud
source: Running Cloud Analysis...
zh_hans: 正在运行云端分析...

# debug.photo.select
source: Select Photo
zh_hans: 选择图片

# debug.photo.thumbnailBytes
source: Thumbnail Bytes
zh_hans: 缩略图字节数

# debug.pipeline.copyTrace
source: Copy Pipeline Trace
zh_hans: 复制处理跟踪

# debug.pipeline.failedStage
source: Failed Stage: %@
zh_hans: 失败阶段：%@

# debug.pipeline.httpStatus
source: HTTP Status
zh_hans: HTTP 状态

# debug.pipeline.noPipelines
source: No pipeline status records exist yet.
zh_hans: 暂无处理状态记录。

# debug.pipeline.noTrace
source: No pipeline trace for the current target.
zh_hans: 当前目标没有处理跟踪。

# debug.pipeline.pipelineError
source: Pipeline Raw Error
zh_hans: 处理流程原始错误

# debug.pipeline.pipelineRequest
source: Pipeline Request
zh_hans: 处理流程请求

# debug.pipeline.pipelineResponse
source: Pipeline Response
zh_hans: 处理流程响应

# debug.provenance.empty
source: No provenance data.
zh_hans: 没有来源数据。

# debug.quality.arc
source: Arc gate
zh_hans: 故事线门控

# debug.quality.arc.filtered
source: No accepted arc. Requires at least two related memories with enough shared signal.
zh_hans: 没有通过的故事线。需要至少两条相关记忆，并且有足够共享信号。

# debug.quality.empty
source: No quality gate data is available for this target yet.
zh_hans: 当前目标还没有质量门控数据。

# debug.quality.entity
source: Entity gate
zh_hans: 实体门控

# debug.quality.footer
source: Shows how Phase 7 quality gates treat raw model output and current pipeline results.
zh_hans: 展示 Phase 7 质量门控如何处理模型原始输出和当前管线结果。

# debug.quality.noTarget
source: Quality target
zh_hans: 质量目标

# debug.quality.recordReflection
source: Record reflection gate
zh_hans: 单条感悟门控

# debug.result.summary
source: Summary
zh_hans: 摘要

# debug.result.title
source: Title
zh_hans: 标题

# debug.section.actions
source: Actions
zh_hans: 操作

# debug.section.allPipelines
source: All Pipelines
zh_hans: 所有处理流程

# debug.section.analyzePayload
source: Analyze Payload
zh_hans: 解析数据

# debug.section.chainStatus
source: Chain Status
zh_hans: 链路状态

# debug.section.contextArtifacts
source: Context artifacts
zh_hans: 上下文 Artifact

# debug.section.customDiagnostic
source: Custom diagnostic memory
zh_hans: 自定义诊断记忆

# debug.section.error
source: Error
zh_hans: 错误

# debug.section.export
source: Export
zh_hans: 导出

# debug.section.pipelineTrace
source: Pipeline Trace
zh_hans: 处理跟踪

# debug.section.provenance
source: Provenance
zh_hans: 来源

# debug.section.qualityGates
source: Quality Gates
zh_hans: 质量门控

# debug.section.reflectionPayload
source: Reflection Payload
zh_hans: 感悟数据

# debug.section.target
source: Target
zh_hans: 目标

# debug.server.baseURL
source: API Base URL
zh_hans: API 基础地址

# debug.server.footer
source: Root and health probes verify reachability. Auth and analysis probes measure endpoint latency; 4xx responses still prove the endpoint is reachable.
zh_hans: 根路径和 health 探针验证可达性。Auth 和 analysis 探针测量端点延迟；4xx 响应仍说明端点可达。

# debug.server.nonHTTP
source: Non-HTTP response
zh_hans: 非 HTTP 响应
